In [2]:
%load_ext sql
%sql sqlite:///chinook.db

'Connected: @chinook.db'

# Задание 1

Вывести 10 самых больших по размеру треков жанра ROCK и формата MPEG (исоп

In [6]:
%%sql
SELECT t.Name
FROM tracks t
join media_types m
on t.MediaTypeId = m.MediaTypeId
order by t.Bytes
desc limit 10

 * sqlite:///chinook.db
Done.

[('Through a Looking Glass',),
 ('Occupation / Precipice',),
 ('The Young Lords',),
 ('The Man With Nine Lives',),
 ('Dave',),
 ('The Magnificent Warriors',),
 ('The Lost Warrior',),
 ('Maternity Leave',),
 ('Battlestar Galactica, Pt. 3',),
 ('The Woman King',)]

## Задание 2
Вывести названия всех групп, их песен и названия их альбомов для всех треков жанра Рок, приобретенные сотрудниками Microsoft.

In [4]:
%%sql select  distinct ar.Name,a.Title,t.Name,g.Name,c.company
from customers c
join invoices i
on i.Customerid = c.Customerid
join invoice_items i_s
on i_s.Invoiceid = i.Invoiceid
join tracks t
on t.Trackid = i_s.Trackid
join genres g
on t.Genreid = g.Genreid
join albums a
on a.Albumid = t.Albumid
join artists ar
on ar.Artistid = a.Artistid
where g.Name like 'Rock'
and c.company like 'Microsoft Corporation'

 * sqlite:///chinook.db
Done.

[("Guns N' Roses", 'Use Your Illusion I', "Double Talkin' Jive", 'Rock', 'Microsoft Corporation'),
 ("Guns N' Roses", 'Use Your Illusion I', 'The Garden', 'Rock', 'Microsoft Corporation'),
 ("Guns N' Roses", 'Use Your Illusion I', "Don't Damn Me", 'Rock', 'Microsoft Corporation'),
 ("Guns N' Roses", 'Use Your Illusion I', 'Dead Horse', 'Rock', 'Microsoft Corporation'),
 ('Foo Fighters', 'In Your Honor [Disc 1]', 'No Way Back', 'Rock', 'Microsoft Corporation'),
 ('Foo Fighters', 'In Your Honor [Disc 2]', 'Still', 'Rock', 'Microsoft Corporation'),
 ('Foo Fighters', 'In Your Honor [Disc 2]', 'Razor', 'Rock', 'Microsoft Corporation'),
 ('Foo Fighters', 'The Colour And The Shape', 'My Hero', 'Rock', 'Microsoft Corporation')]

## Задание 3
Для каждого набора (жанр, тип медиа) вывести среднюю цену по стоимости трека и общее количество, причем вывести только те наборы, для которых все треки стоят больше 1,5$.

In [13]:
%%sql
select coco.genreid,coco.mediatypeid,coco.sredprice,coco.amount from(select MG.Genreid,
MG.MediaTypeid,avg(t.unitprice) as sredPRICE,count(t.trackid) as AMOUNT 
from (media_types,genres) MG
join tracks t
ON t.MediaTypeid=MG.MediaTypeid
AND t.Genreid=MG.Genreid
group by MG.mediatypeid,MG.genreid
having(min(T.unitprice)>1.5))coco
join genres g 
on coco.genreid = g.genreid
join media_types m
on m.mediatypeid = coco.mediatypeid

 * sqlite:///chinook.db
Done.

[(18, 3, 1.9899999999999995, 13),
 (19, 3, 1.990000000000001, 93),
 (20, 3, 1.9900000000000004, 26),
 (21, 3, 1.9899999999999978, 64),
 (22, 3, 1.9899999999999995, 17)]

## Задание 4
Вывести компании, сделавшие максимальное и минимальное число заказов. Необходимо исключить клиентов без компании (NULL)

In [3]:
%%sql
select c.company,count(i.invoiceid) as Kolvo
from customers c
join invoices i
on c.customerid = i.customerid,
    (
     select max(kolvo) as Max_KOLVO,min(kolvo) as Min_KOLVO
     from(
            select c.company as comp,count(i.invoiceid) as kolvo
                    from customers c
                    join invoices i
                    on c.customerid = i.customerid
                    where c.company is not NULL
                group by company
         )
    coco
    )
maxmin
where c.company is not NULL
group by company,Max_KOLVO,Min_KOLVO
having count(i.invoiceid) = Max_KOLVO
or count(i.invoiceid) = Min_KOLVO

 * sqlite:///chinook.db
Done.

[('Apple Inc.', 7),
 ('Banco do Brasil S.A.', 7),
 ('Embraer - Empresa Brasileira de Aeronáutica S.A.', 7),
 ('Google Inc.', 7),
 ('JetBrains s.r.o.', 7),
 ('Microsoft Corporation', 7),
 ('Riotur', 7),
 ('Rogers Canada', 7),
 ('Telus', 7),
 ('Woodstock Discos', 7)]

## Задание 5
Для каждой компании вывести общее количестов песен, купленных по жанру поп-музыки

In [39]:
%%sql
select company,count(i.invoiceid) as kolvo
from customers c
join invoices i
on c.customerid = i.customerid
join invoice_items ii 
on i.invoiceid = ii.invoiceid
join tracks t 
on ii.trackid = t.trackid
join genres g
on t.genreid = g.genreid
where g.name like 'pop' 
group by company,g.name

 * sqlite:///chinook.db
Done.

[(None, 22),
 ('Embraer - Empresa Brasileira de Aeronáutica S.A.', 2),
 ('JetBrains s.r.o.', 4)]

## Задание 6
Вывести средний размер альбома в байтах.

In [96]:
%%sql
select avg(koko.kolvo)
from(
    select t.albumid album,sum(t.bytes) as kolvo
    from tracks t
    join albums using(albumid)      
    group by albumid
)koko

 * sqlite:///chinook.db
Done.

[(338288920.3170029,)]